In [ ]:
from pandas import *

In [ ]:
data = read_excel('WHOPOP.xls')

In [9]:
type(data)

pandas.core.frame.DataFrame

In [8]:
data

                                Country  Population (1000s)  TB deaths
0                           Afghanistan               30552   13000.00
1                               Albania                3173      20.00
2                               Algeria               39208    5100.00
3                               Andorra                  79       0.26
4                                Angola               21472    6900.00
..                                  ...                 ...        ...
189  Venezuela (Bolivarian Republic of)               30405     480.00
190                            Viet Nam               91680   17000.00
191                               Yemen               24407     990.00
192                              Zambia               14539    3600.00
193                            Zimbabwe               14150    5700.00

[194 rows x 3 columns]

In [10]:
data.describe

<bound method NDFrame.describe of                                 Country  Population (1000s)  TB deaths
0                           Afghanistan               30552   13000.00
1                               Albania                3173      20.00
2                               Algeria               39208    5100.00
3                               Andorra                  79       0.26
4                                Angola               21472    6900.00
..                                  ...                 ...        ...
189  Venezuela (Bolivarian Republic of)               30405     480.00
190                            Viet Nam               91680   17000.00
191                               Yemen               24407     990.00
192                              Zambia               14539    3600.00
193                            Zimbabwe               14150    5700.00

[194 rows x 3 columns]>

In [11]:
tbColumn = data['TB deaths']
tbColumn

0      13000.00
1         20.00
2       5100.00
3          0.26
4       6900.00
         ...
189      480.00
190    17000.00
191      990.00
192     3600.00
193     5700.00
Name: TB deaths, Length: 194, dtype: float64

In [12]:
tbColumn.sum()

1072677.97

In [14]:
tbColumn.max()

240000.0

In [15]:
tbColumn.min()

0.0

In [16]:
data.sort_values('TB deaths')

        Country  Population (1000s)  TB deaths
147  San Marino                  31       0.00
125        Niue                   1       0.01
111      Monaco                  38       0.03
3       Andorra                  79       0.26
129       Palau                  21       0.36
..          ...                 ...        ...
128    Pakistan              182143   49000.00
78    Indonesia              249866   64000.00
13   Bangladesh              156595   80000.00
124     Nigeria              173615  160000.00
77        India             1252140  240000.00

[194 rows x 3 columns]

In [17]:
populationColumn = data['Population (1000s)']

In [18]:
populationColumn

0      30552
1       3173
2      39208
3         79
4      21472
       ...
189    30405
190    91680
191    24407
192    14539
193    14150
Name: Population (1000s), Length: 194, dtype: int64

In [19]:
populationColumn.sum()

7126099

In [20]:
data['TB deaths (per 100,000)'] = tbColumn * 100 / populationColumn
data

,Country,Population (1000s),TB deaths,"TB deaths (per 100,000)"
0,Afghanistan,30552,13000.00,42.550406
1,Albania,3173,20.00,0.630318
2,Algeria,39208,5100.00,13.007549
3,Andorra,79,0.26,0.329114
4,Angola,21472,6900.00,32.134873
...,...,...,...,...
189,Venezuela (Bolivarian Republic of),30405,480.00,1.578688
190,Viet Nam,91680,17000.00,18.542757
191,Yemen,24407,990.00,4.056213
192,Zambia,14539,3600.00,24.760988
193,Zimbabwe,14150,5700.00,40.282686